bench-http/results/2026-09-13-alternating-4-rounds/round1-sequential.hey.txt

Summary:
  Total:	15.0034 secs
  Slowest:	0.0237 secs
  Fastest:	0.0001 secs
  Average:	0.0035 secs
  Requests/sec:	14187.6210
  
  Total data:	425724 bytes
  Size/request:	2 bytes

Response time histogram:
  0.000 [1]	|
  0.002 [5047]	|■
  0.005 [199057]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.007 [7411]	|■
  0.010 [578]	|
  0.012 [206]	|
  0.014 [211]	|
  0.017 [132]	|
  0.019 [127]	|
  0.021 [68]	|
  0.024 [24]	|


Latency distribution:
  10%% in 0.0029 secs
  25%% in 0.0030 secs
  50%% in 0.0033 secs
  75%% in 0.0039 secs
  90%% in 0.0043 secs
  95%% in 0.0047 secs
  99%% in 0.0061 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0067 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0023 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0009 secs
  resp wait:	0.0035 secs, 0.0001 secs, 0.0237 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0046 secs

Status code distribution:
  [200]	212862 responses