bench-http/results/2026-09-13-alternating-4-rounds/round3-fanout.hey.txt

Summary:
  Total:	15.0034 secs
  Slowest:	0.0637 secs
  Fastest:	0.0001 secs
  Average:	0.0047 secs
  Requests/sec:	10642.2999
  
  Total data:	319342 bytes
  Size/request:	2 bytes

Response time histogram:
  0.000 [1]	|
  0.006 [151762]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.013 [7335]	|■■
  0.019 [475]	|
  0.026 [45]	|
  0.032 [1]	|
  0.038 [2]	|
  0.045 [3]	|
  0.051 [1]	|
  0.057 [4]	|
  0.064 [42]	|


Latency distribution:
  10%% in 0.0036 secs
  25%% in 0.0039 secs
  50%% in 0.0045 secs
  75%% in 0.0051 secs
  90%% in 0.0059 secs
  95%% in 0.0065 secs
  99%% in 0.0092 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0026 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0014 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0012 secs
  resp wait:	0.0047 secs, 0.0001 secs, 0.0636 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0114 secs

Status code distribution:
  [200]	159671 responses